{"keras_version": "2.0.8", "config": [{"config": {"kernel_regularizer": null, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "filters": 32, "use_bias": true, "kernel_constraint": null, "name": "conv2d_5", "dtype": "float32", "data_format": "channels_last", "batch_input_shape": [null, 28, 28, 1], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "activity_regularizer": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_5", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "filters": 64, "use_bias": true, "kernel_constraint": null, "name": "conv2d_6", "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_6", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "use_bias": true, "name": "dense_5", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1000}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "use_bias": true, "name": "dense_6", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}